espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_security.c
/***************************************************************************/ /**
 * @file
 * @brief CPC Security Endpoint API implementation.
 *******************************************************************************
 * # License
 * <b>Copyright 2019 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#if defined(SL_COMPONENT_CATALOG_PRESENT)
#include "sl_component_catalog.h"
#endif

#include "mbedtls/bignum.h"
#include "psa/crypto.h"
#include "psa/crypto_sizes.h"

#include "sl_cpc.h"
#include "sli_cpc.h"
#include "sli_cpc_hdlc.h"
#include "sl_atomic.h"
#include "sli_cpc_security.h"

#include "em_core.h"
#include "sl_assert.h"

/*******************************************************************************
 *********************************   DEFINES   *********************************
 ******************************************************************************/
#define SLI_CPC_SECURITY_PSA_CRYPTO_BINDING_KEY_ID 0x00004200

#if !defined(SLI_CPC_SECURITY_NONCE_FRAME_COUNTER_RESET_VALUE)
#define SLI_CPC_SECURITY_NONCE_FRAME_COUNTER_RESET_VALUE 0
#endif

/*******************************************************************************
 ***************************  LOCAL VARIABLES   ********************************
 ******************************************************************************/

static sl_cpc_security_state_t security_state = SL_CPC_SECURITY_STATE_NOT_READY;

#if (SL_CPC_ENDPOINT_SECURITY_ENABLED >= 1)
#if (defined(SLI_CPC_DEVICE_UNDER_TEST))
bool security_endpoint_initialized = false;
sl_cpc_endpoint_handle_t security_ep;
#else
static sl_cpc_endpoint_handle_t security_ep;
#endif

static sli_cpc_security_protocol_cmd_t security_protocol_response;
static sli_cpc_security_protocol_cmd_t security_protocol_request;
static bool security_write_completed = true;
static bool security_request_pending = false;
static bool security_endpoint_in_error = false;

#if (SL_CPC_SECURITY_BINDING_KEY_METHOD == SL_CPC_SECURITY_BINDING_KEY_ECDH)
static uint8_t peer_public_key[SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES];
static uint8_t our_public_key[SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES];
static size_t our_public_key_len = SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES;
#endif

static bool is_bound = false;
static psa_key_id_t session_key_id;
static const psa_key_id_t binding_key_id = SLI_CPC_SECURITY_PSA_CRYPTO_BINDING_KEY_ID;

static sli_cpc_security_nonce_t nonce_primary;
static sli_cpc_security_nonce_t nonce_secondary;

static sl_slist_node_t *unbind_observers;

const sli_cpc_security_protocol_cmd_info_t sli_cpc_security_command[] = {
  [BINDING_REQUEST_ID] =  {
    .request_len = sizeof(uint8_t),
    .response_len = sizeof(sl_status_t),
    .command_id = BINDING_REQUEST_ID
  },
  [PLAIN_TEXT_KEY_SHARE_ID] =  {
    .request_len = SLI_SECURITY_BINDING_KEY_LENGTH_BYTES,
    .response_len = sizeof(sl_status_t),
    .command_id = PLAIN_TEXT_KEY_SHARE_ID
  },
  [PUBLIC_KEY_SHARE_ID] =  {
    .request_len = SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES,
    .response_len = sizeof(sl_status_t) + SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES,
    .command_id = PUBLIC_KEY_SHARE_ID
  },
  [SESSION_INIT_ID] =  {
    .request_len = SLI_SECURITY_SESSION_INIT_RANDOM_LENGTH_BYTES,
    .response_len = sizeof(sl_status_t) + SLI_SECURITY_SESSION_INIT_RANDOM_LENGTH_BYTES,
    .command_id = SESSION_INIT_ID
  },
  [UNBIND_REQUEST_ID] =  {
    .request_len = 0x0000,
    .response_len = sizeof(sl_status_t),
    .command_id = UNBIND_REQUEST_ID
  },
};
#endif

/*******************************************************************************
 **************************   LOCAL FUNCTIONS   ********************************
 ******************************************************************************/
static void set_state(sl_cpc_security_state_t new_value);

#if (SL_CPC_ENDPOINT_SECURITY_ENABLED >= 1)
static sl_status_t initialize_session(uint8_t *random1, uint8_t *random2);

static bool security_open_endpoint(void);

static psa_algorithm_t get_algorithm(void);

static void security_nonce_increment(sli_cpc_security_nonce_t *nonce);

static sl_status_t store_binding_key(uint8_t *key, uint16_t key_size);

static sl_status_t erase_binding_key(void);

static void security_recover_endpoint(void);

static sl_status_t psa_status_to_sl_status(psa_status_t status);

static void process_security_command_rx(sli_cpc_security_protocol_cmd_t *cmd);

static void send_request(sli_cpc_security_protocol_cmd_t *request);

static psa_status_t encrypt(const uint8_t *header,
                            const size_t header_len,
                            uint8_t *payload,
                            const size_t payload_len,
                            uint8_t *tag,
                            const size_t tag_len);

static psa_status_t decrypt(const uint8_t *header,
                            const size_t header_len,
                            uint8_t *payload,
                            const size_t buffer_size,
                            const size_t payload_len,
                            size_t *output_len);
#endif

