espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_security.c
/*******************************************************************************
 **************************   GLOBAL FUNCTIONS   *******************************
 ******************************************************************************/

/***************************************************************************//**
 * Init Security endpoint
 ******************************************************************************/
sl_status_t sli_cpc_security_init(void)
{
#if (SL_CPC_ENDPOINT_SECURITY_ENABLED >= 1)
#if (SL_CPC_SECURITY_BINDING_KEY_METHOD == SL_CPC_SECURITY_BINDING_KEY_CUSTOMER_SPECIFIC)
  sl_status_t status;
  uint8_t *key = NULL;
  uint16_t key_size = 0;
#endif

  psa_status_t psa_status =  psa_crypto_init();
  EFM_ASSERT(psa_status == PSA_SUCCESS);

  if (psa_is_key_present_in_storage(binding_key_id)) {
    is_bound = true;
  } else {
#if (SL_CPC_SECURITY_BINDING_KEY_METHOD == SL_CPC_SECURITY_BINDING_KEY_CUSTOMER_SPECIFIC)
    sl_cpc_security_fetch_user_specified_binding_key(&key, &key_size);
    EFM_ASSERT(key != NULL);
    EFM_ASSERT(key_size == 16);

    status = store_binding_key(key, key_size);
    EFM_ASSERT(status == SL_STATUS_OK);
#else
    is_bound = false;
#endif
  }

  set_state(SL_CPC_SECURITY_STATE_INITIALIZING);
  security_open_endpoint();

#else
  set_state(SL_CPC_SECURITY_STATE_DISABLED);
#endif
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Get Security State
 ******************************************************************************/
sl_cpc_security_state_t sl_cpc_security_get_state(void)
{
  sl_cpc_security_state_t local_state;

  sl_atomic_load(local_state, security_state);

  return local_state;
}

/***************************************************************************//**
 * Callback for getting the user binding key
 ******************************************************************************/
__WEAK void sl_cpc_security_fetch_user_specified_binding_key(uint8_t **key, uint16_t *key_size_in_bytes)
{
  (void)key;
  (void)key_size_in_bytes;
  EFM_ASSERT(0); // User must provide the binding key by overriding this function
}

/***************************************************************************//**
 * Callback to allow unbind request from the Host
 ******************************************************************************/
__WEAK uint64_t sl_cpc_security_on_unbind_request(bool is_link_encrypted)
{
  (void) is_link_encrypted;
  return 0; // Not allowed to unbind by default
}

#if (SL_CPC_ENDPOINT_SECURITY_ENABLED >= 1)
/***************************************************************************//**
 * Process security endpoint
 ******************************************************************************/
void sli_cpc_security_process(void)
{
  sl_status_t status;
  void *read_buffer;
  uint16_t size;

#if (defined(SLI_CPC_DEVICE_UNDER_TEST))
  if (security_endpoint_initialized == false) {
    return;
  }
#endif

  sli_cpc_security_protocol_cmd_t *rx_security_cmd;

  // Recover the security endpoint if it failed
  if (security_endpoint_in_error) {
    security_recover_endpoint();
    if (security_endpoint_in_error) {
      return; // Could not recover the security endpoint retry the process later on
    }
  }

  if (security_write_completed == true) {
    status = sl_cpc_read(&security_ep, &read_buffer, &size, 0u, SL_CPC_FLAG_NO_BLOCK);

    if (status == SL_STATUS_OK) {
      rx_security_cmd = (sli_cpc_security_protocol_cmd_t *)read_buffer;
      process_security_command_rx(rx_security_cmd);
    } else if (status == SL_STATUS_EMPTY) {
      if (security_request_pending) {
        send_request(&security_protocol_request);
        security_request_pending = false;
      }
    } else {
      security_recover_endpoint();
    }
  }
}

sl_status_t sl_cpc_security_unbind(void)
{
  sl_cpc_unbind_notification_handle_t *handle;

  SL_SLIST_FOR_EACH_ENTRY(unbind_observers, handle, sl_cpc_unbind_notification_handle_t, node) {
    EFM_ASSERT(handle->fnct != NULL);
    handle->fnct(handle->data);
  }

  return erase_binding_key();
}

sl_status_t sl_cpc_security_unbind_subscribe(sl_cpc_unbind_notification_handle_t *handle,
                                             sl_cpc_unbind_notification_t callback,
                                             void *data)
{
  if (handle == NULL || callback == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  handle->fnct = callback;
  handle->data = data;

  CORE_ATOMIC_SECTION(sl_slist_push_back(&unbind_observers, &handle->node); );

  return SL_STATUS_OK;
}

sl_status_t sl_cpc_security_unbind_unsubscribe(sl_cpc_unbind_notification_handle_t *handle)
{
  if (handle == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  handle->fnct = NULL;
  handle->data = NULL;
  sl_slist_remove(&unbind_observers, &handle->node);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Encrypt data
 ******************************************************************************/
sl_status_t sli_cpc_security_encrypt(const uint8_t address,
                                     const uint8_t *header, const size_t header_len,
                                     uint8_t *payload, const size_t payload_len,
                                     uint8_t *tag, const size_t tag_len)
{
  psa_status_t ret;

  nonce_secondary.endpoint_id = address;

  ret = encrypt(header, header_len,
                payload, payload_len,
                tag, tag_len);

  if (ret == PSA_SUCCESS) {
    security_nonce_increment(&nonce_secondary);
  }

  nonce_secondary.endpoint_id = 0;

  return psa_status_to_sl_status(ret);
}

/***************************************************************************//**
 * Decrypt data
 ******************************************************************************/
sl_status_t sli_cpc_security_decrypt(const uint8_t *header, const size_t header_len,
                                     uint8_t *payload, const size_t buffer_len,
                                     const size_t payload_len, size_t *output_len)
{
  psa_status_t ret = decrypt(header, header_len, payload,
                             buffer_len, payload_len, output_len);

  if (ret == PSA_SUCCESS) {
    security_nonce_increment(&nonce_primary);
  }

  return psa_status_to_sl_status(ret);
}

/***************************************************************************//**
 * Packet drop notification
 ******************************************************************************/
void sli_cpc_security_drop_incoming_packet(void)
{
  sl_cpc_security_state_t security_state = sl_cpc_security_get_state();

