espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_security.c
  if (security_state == SL_CPC_SECURITY_STATE_INITIALIZED) {
    nonce_primary.frame_counter++;
  }
}

/***************************************************************************//**
 * Init Nonce
 ******************************************************************************/
static void security_nonce_init(sli_cpc_security_nonce_t *nonce)
{
  nonce->endpoint_id = 0;
  nonce->frame_counter = SLI_CPC_SECURITY_NONCE_FRAME_COUNTER_RESET_VALUE;
}

/***************************************************************************//**
 * Security error
 ******************************************************************************/
static void on_security_error(uint8_t endpoint_id, void *arg)
{
  (void)arg;

  EFM_ASSERT(endpoint_id == SL_CPC_ENDPOINT_SECURITY);

  if (sl_cpc_get_endpoint_state(&security_ep) != SL_CPC_STATE_OPEN) {
    security_endpoint_in_error = true;
  }
}

/***************************************************************************//**
 * Write completed
 ******************************************************************************/
static void on_security_write_completed(sl_cpc_user_endpoint_id_t endpoint_id,
                                        void *buffer, void *arg, sl_status_t status)
{
  sl_cpc_security_state_t state;
  (void) endpoint_id;
  (void) arg;
  (void) buffer;

  EFM_ASSERT(endpoint_id == SL_CPC_ENDPOINT_SECURITY);

  if (status != SL_STATUS_OK) {
    security_endpoint_in_error = true;
  }

  security_write_completed = true;

  state = sl_cpc_security_get_state();
  if (state == SL_CPC_SECURITY_STATE_WAITING_ON_TX_COMPLETE) {
    set_state(SL_CPC_SECURITY_STATE_INITIALIZED);
  }
}

/***************************************************************************//**
 * Command is a response
 ******************************************************************************/
static bool cmd_is_a_response(sli_cpc_security_protocol_cmd_t *cmd)
{
  if (cmd->command_id & SLI_CPC_SECURITY_PROTOCOL_RESPONSE_MASK) {
    return true;
  }
  return false;
}

/***************************************************************************//**
 * Send request
 ******************************************************************************/
static void send_request(sli_cpc_security_protocol_cmd_t *request)
{
  EFM_ASSERT(security_write_completed == true);
  security_write_completed = false;

  sl_cpc_write(&security_ep, request,
               request->len + SLI_SECURITY_PROTOCOL_HEADER_LENGTH,
               0,
               (void *)on_security_write_completed);
}

/***************************************************************************//**
 * Write response
 ******************************************************************************/
static void send_response(sli_cpc_security_protocol_cmd_t *response)
{
  EFM_ASSERT(security_write_completed == true);
  security_write_completed = false;

  sl_cpc_write(&security_ep, response,
               response->len + SLI_SECURITY_PROTOCOL_HEADER_LENGTH,
               0,
               (void *)on_security_write_completed);
}

/***************************************************************************//**
 * On Bind command
 ******************************************************************************/
static void on_binding_cmd(sli_cpc_security_protocol_cmd_t *cmd)
{
  uint8_t binding_type;
  sl_status_t status;

  binding_type = cmd->payload[0];
  security_protocol_response.len = sli_cpc_security_command[BINDING_REQUEST_ID].response_len;
  security_protocol_response.command_id = cmd->command_id | SLI_CPC_SECURITY_PROTOCOL_RESPONSE_MASK;

  if (is_bound) {
    status = SL_STATUS_ALREADY_INITIALIZED;
  } else {
    switch (binding_type) {
      case SLI_CPC_SECURITY_PROTOCOL_BINDING_TYPE_PLAINTEXT:
#if (SL_CPC_SECURITY_BINDING_KEY_METHOD == SL_CPC_SECURITY_BINDING_KEY_PLAINTEXT_SHARE)
        status = SL_STATUS_OK;
#else
        status = SL_STATUS_INVALID_MODE;
#endif
        break;
      case SLI_CPC_SECURITY_PROTOCOL_BINDING_TYPE_ECDH:
#if (SL_CPC_SECURITY_BINDING_KEY_METHOD == SL_CPC_SECURITY_BINDING_KEY_ECDH)
        status = SL_STATUS_OK;
#else
        status = SL_STATUS_INVALID_MODE;
#endif
        break;
      default:
        status = SL_STATUS_INVALID_MODE;
        break;
    }
  }

  memcpy(&security_protocol_response.payload, &status, sizeof(status));
  send_response(&security_protocol_response);
}

/***************************************************************************//**
 * On plaintext key share command
 ******************************************************************************/
static void on_plaintext_key_share_cmd(sli_cpc_security_protocol_cmd_t *cmd)
{
  sl_status_t status = SL_STATUS_FAIL;

#if (SL_CPC_SECURITY_BINDING_KEY_METHOD == SL_CPC_SECURITY_BINDING_KEY_PLAINTEXT_SHARE)
  status = store_binding_key(cmd->payload, SLI_SECURITY_BINDING_KEY_LENGTH_BYTES);
#else
  status = SL_STATUS_INVALID_MODE;
#endif

  security_protocol_response.len = sli_cpc_security_command[cmd->command_id].response_len;
  security_protocol_response.command_id = cmd->command_id | SLI_CPC_SECURITY_PROTOCOL_RESPONSE_MASK;
  memcpy(&security_protocol_response.payload, &status, sizeof(status));
  send_response(&security_protocol_response);
}

/***************************************************************************//**
 * ECDH Exchange
 ******************************************************************************/
#if (SL_CPC_SECURITY_BINDING_KEY_METHOD == SL_CPC_SECURITY_BINDING_KEY_ECDH)
static sl_status_t ecdh_exchange(uint8_t* peer_key, size_t peer_key_len)
{
  psa_key_id_t private_key;
  psa_status_t psa_status;
  psa_key_attributes_t key_attributes;
  sl_status_t status;

  mbedtls_mpi peer_key_big_endian;
  mbedtls_mpi our_public_key_big_endian;
  uint8_t* sha256_output;
  uint8_t* shared_secret;
  mbedtls_mpi shared_secret_big_endian;
  size_t hash_out_len;
  size_t shared_secret_len;

  if (peer_key_len != SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  mbedtls_mpi_init(&peer_key_big_endian);
  mbedtls_mpi_init(&our_public_key_big_endian);
  mbedtls_mpi_init(&shared_secret_big_endian);

  sha256_output = malloc(SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES);
  shared_secret = malloc(SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES);
  EFM_ASSERT(sha256_output != NULL);
  EFM_ASSERT(shared_secret != NULL);

  key_attributes = psa_key_attributes_init();
  psa_set_key_usage_flags(&key_attributes, PSA_KEY_USAGE_DERIVE);
  psa_set_key_algorithm(&key_attributes, PSA_ALG_ECDH);
  psa_set_key_type(&key_attributes, PSA_KEY_TYPE_ECC_KEY_PAIR(PSA_ECC_FAMILY_MONTGOMERY));
  psa_set_key_bits(&key_attributes, 255);

  // Generate private key
  psa_status = psa_generate_key(&key_attributes, &private_key);
  if (psa_status != PSA_SUCCESS) {
    status = SL_STATUS_FAIL;
    goto cleanup;
  }

  // Obtain the public key from the keypair
  psa_status = psa_export_public_key(private_key,
                                     our_public_key, SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES,
                                     &our_public_key_len);
  if (psa_status != PSA_SUCCESS) {
    EFM_ASSERT(psa_destroy_key(private_key) == PSA_SUCCESS);
    private_key = MBEDTLS_SVC_KEY_ID_INIT;
    status = SL_STATUS_FAIL;
    goto cleanup;
  }

  // Convert our public key to big endian and the peer key to little endian
  // This is done to work around a limitation in MbedTLS 2.16 LTS that only handles big endian keys with ECP-Montgomery
  mbedtls_mpi_read_binary_le(&our_public_key_big_endian, our_public_key, SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES);
  mbedtls_mpi_write_binary(&our_public_key_big_endian, our_public_key, SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES);
  mbedtls_mpi_read_binary(&peer_key_big_endian, peer_key, SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES);
  mbedtls_mpi_write_binary_le(&peer_key_big_endian, peer_key, SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES);

  // Compute ECDH shared secret
  psa_status = psa_raw_key_agreement(PSA_ALG_ECDH,
                                     private_key,
                                     peer_key,
                                     peer_key_len,
                                     shared_secret,
                                     SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES,
                                     &shared_secret_len);
  if (psa_status != PSA_SUCCESS) {
    EFM_ASSERT(psa_destroy_key(private_key) == PSA_SUCCESS);
    private_key = MBEDTLS_SVC_KEY_ID_INIT;
    status = SL_STATUS_FAIL;
    goto cleanup;
  }

  mbedtls_mpi_read_binary(&shared_secret_big_endian, shared_secret, SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES);
  mbedtls_mpi_write_binary_le(&shared_secret_big_endian, shared_secret, SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES);

  psa_status = psa_hash_compute(PSA_ALG_SHA_256, shared_secret, SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES,
                                sha256_output, SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES,
                                &hash_out_len);
  if (psa_status != PSA_SUCCESS || hash_out_len != SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES) {
    EFM_ASSERT(psa_destroy_key(private_key) == PSA_SUCCESS);
    private_key = MBEDTLS_SVC_KEY_ID_INIT;
    status = SL_STATUS_FAIL;
    goto cleanup;
  }

  // Get rid of the private_key
  psa_status = psa_destroy_key(private_key);
  if (psa_status != PSA_SUCCESS) {
    mbedtls_platform_zeroize(sha256_output, SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES);
    status = SL_STATUS_FAIL;
    goto cleanup;
  }

  private_key = MBEDTLS_SVC_KEY_ID_INIT;

  // Store the binding key by truncating the first bytes from the sha256 output
  if (store_binding_key(sha256_output, SLI_SECURITY_BINDING_KEY_LENGTH_BYTES) != SL_STATUS_OK) {
    status = SL_STATUS_FAIL;
    goto cleanup;
  }

  status = SL_STATUS_OK;

  cleanup:
  mbedtls_platform_zeroize(sha256_output, SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES);
  mbedtls_platform_zeroize(shared_secret, SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES);
  free(sha256_output);
  free(shared_secret);

