espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_security.c
  return status;
}
#endif

/***************************************************************************//**
 * On public share command
 ******************************************************************************/
static void on_public_key_share_cmd(sli_cpc_security_protocol_cmd_t *cmd)
{
  sl_status_t status;

#if (SL_CPC_SECURITY_BINDING_KEY_METHOD == SL_CPC_SECURITY_BINDING_KEY_ECDH)
  memcpy(peer_public_key, &cmd->payload, SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES);
  status = ecdh_exchange(peer_public_key, SLI_SECURITY_PUBLIC_KEY_LENGTH_BYTES);
  memcpy(security_protocol_response.payload + sizeof(status), our_public_key, our_public_key_len);
#else
  status = SL_STATUS_NOT_SUPPORTED;
#endif

  security_protocol_response.len = sli_cpc_security_command[cmd->command_id].response_len;
  security_protocol_response.command_id = cmd->command_id | SLI_CPC_SECURITY_PROTOCOL_RESPONSE_MASK;
  memcpy(&security_protocol_response.payload, &status, sizeof(status));
  send_response(&security_protocol_response);
}

/***************************************************************************//**
 * On Session init command
 ******************************************************************************/
static void on_session_init_cmd(sli_cpc_security_protocol_cmd_t *cmd)
{
  sli_cpc_security_session_init_response_t *response = (sli_cpc_security_session_init_response_t*)security_protocol_response.payload;

  if (is_bound) {
    response->status = initialize_session(cmd->payload, response->random2);
  } else {
    response->status = SL_STATUS_NOT_INITIALIZED;
    //Just to be pedantic and not leak anything
    mbedtls_platform_zeroize(response->random2, sizeof(response->random2));
  }

  security_protocol_response.len = sli_cpc_security_command[cmd->command_id].response_len;
  security_protocol_response.command_id = cmd->command_id | SLI_CPC_SECURITY_PROTOCOL_RESPONSE_MASK;
  send_response(&security_protocol_response);
}

/***************************************************************************//**
 * On unbind command
 ******************************************************************************/
static void on_unbind_cmd(sli_cpc_security_protocol_cmd_t *cmd)
{
  sl_status_t status;
  bool allow_unbind;
  uint64_t ret;

  // According to the spec:
  // The corresponding check for the return value should be glitch-hardened
  // by checking the return value twice in different ways (to avoid the compiler from optimizing it away)
  volatile uint64_t ok_to_unbind_magic = 0xAAAAAAAAAAAAAAAA;
  ret = sl_cpc_security_on_unbind_request(sl_cpc_security_get_state() == SL_CPC_SECURITY_STATE_INITIALIZED);
  if (ret == SL_CPC_SECURITY_OK_TO_UNBIND && ret == ok_to_unbind_magic) {
    allow_unbind = true;
  } else {
    allow_unbind = false;
  }

  if (allow_unbind) {
    status = sl_cpc_security_unbind();
  } else {
    status = SL_STATUS_PERMISSION;
  }

  security_protocol_response.len = sli_cpc_security_command[cmd->command_id].response_len;
  security_protocol_response.command_id = cmd->command_id | SLI_CPC_SECURITY_PROTOCOL_RESPONSE_MASK;
  memcpy(&security_protocol_response.payload, &status, sizeof(status));
  send_response(&security_protocol_response);
}

/***************************************************************************//**
 * Process security command
 ******************************************************************************/
static void process_security_command_rx(sli_cpc_security_protocol_cmd_t *cmd)
{
  if (cmd_is_a_response(cmd)) {
    EFM_ASSERT(0); // Should not receive a response, only requests are allowed
  }

  EFM_ASSERT(cmd->command_id >= BINDING_REQUEST_ID && cmd->command_id <= UNBIND_REQUEST_ID);
  EFM_ASSERT(cmd->len == sli_cpc_security_command[cmd->command_id].request_len);

  // Check if the command is a response or a request
  switch (cmd->command_id) {
    case BINDING_REQUEST_ID:
      on_binding_cmd(cmd);
      break;
    case PLAIN_TEXT_KEY_SHARE_ID:
      on_plaintext_key_share_cmd(cmd);
      break;
    case PUBLIC_KEY_SHARE_ID:
      on_public_key_share_cmd(cmd);
      break;
    case SESSION_INIT_ID:
      on_session_init_cmd(cmd);
      break;
    case UNBIND_REQUEST_ID:
      on_unbind_cmd(cmd);
      break;
    default:
      EFM_ASSERT(0); // Unknown command
  }
}

/***************************************************************************//**
 * Security endpoint open function, will return false if endpoint is busy (CLOSING)
 ******************************************************************************/
static bool security_open_endpoint(void)
{
  sl_status_t status;

  status = sli_cpc_open_service_endpoint(&security_ep, SL_CPC_ENDPOINT_SECURITY, 0, 1);
  if (status == SL_STATUS_BUSY) {
    return false;
  }
  EFM_ASSERT(status == SL_STATUS_OK);

  status = sl_cpc_set_endpoint_option(&security_ep,
                                      SL_CPC_ENDPOINT_ON_IFRAME_WRITE_COMPLETED,
                                      (void *)on_security_write_completed);
  EFM_ASSERT(status == SL_STATUS_OK);

  status = sl_cpc_set_endpoint_option(&security_ep, SL_CPC_ENDPOINT_ON_ERROR, (void *)on_security_error);
  EFM_ASSERT(status == SL_STATUS_OK);

  return true;
}

/***************************************************************************//**
 * Recover security endpoint
 ******************************************************************************/
static void security_recover_endpoint(void)
{
  EFM_ASSERT(SL_STATUS_OK == sl_cpc_close_endpoint(&security_ep));

  if (security_open_endpoint()) {
    security_write_completed = true;
    security_endpoint_in_error = false;
  }
}

/***************************************************************************//**
 * Store binding key
 ******************************************************************************/
static sl_status_t store_binding_key(uint8_t *key, uint16_t key_size)
{
  if (key == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if (key_size != SLI_SECURITY_BINDING_KEY_LENGTH_BYTES) {
    // Only 128-bits key is supported
    return SL_STATUS_NOT_SUPPORTED;
  }

  if (is_bound) {
    return SL_STATUS_ALREADY_INITIALIZED;
  }
#define PSA_ALG_NONE ((psa_algorithm_t)0)

  // Set key attributes.
  psa_key_attributes_t attr = psa_key_attributes_init();
  psa_set_key_algorithm(&attr, PSA_ALG_NONE);
  psa_set_key_usage_flags(&attr, PSA_KEY_USAGE_EXPORT);
  psa_set_key_type(&attr, PSA_KEY_TYPE_RAW_DATA);
  psa_set_key_bits(&attr, PSA_BYTES_TO_BITS(key_size));
  psa_set_key_id(&attr, binding_key_id);
  psa_set_key_lifetime(&attr, PSA_KEY_LIFETIME_FROM_PERSISTENCE_AND_LOCATION(
                         PSA_KEY_LIFETIME_PERSISTENT, PSA_KEY_LOCATION_LOCAL_STORAGE));

  // Import key.
  psa_key_id_t key_id;
  psa_status_t psa_status = psa_import_key(&attr,
                                           key,
                                           key_size,
                                           &key_id);

  // The key is expected to be in RAM, we need to squash it now that it's loaded in the SE
  mbedtls_platform_zeroize(key, key_size);

#if (defined(SLI_CPC_DEVICE_UNDER_TEST))
  security_endpoint_initialized = true;
#endif

  //Big logic corruption with is_bound flash if the key already exists
  EFM_ASSERT(psa_status != PSA_ERROR_ALREADY_EXISTS);

  // Output result.
  if (psa_status == PSA_SUCCESS) {
    // When registering a persistent key, the returned key_id should be equal to
    // the one set with psa_set_key_id. Something is terribly wrong if it isn't
    EFM_ASSERT(key_id == binding_key_id);
    is_bound = true;
    return SL_STATUS_OK;
  } else {
    return SL_STATUS_FAIL;
  }
}

/***************************************************************************//**
 * Erase binding key
 ******************************************************************************/
sl_status_t erase_binding_key(void)
{
  //Check if the key is already erased
  if (psa_is_key_present_in_storage(binding_key_id) == 0) {
    //Just a sanity check to make sure 'is_bound' flag is consistent with the key status
    EFM_ASSERT(is_bound == false);
    return (sl_status_t) SL_STATUS_NOT_INITIALIZED;
  }

  if (psa_destroy_persistent_key(binding_key_id) != PSA_SUCCESS) {
    return (sl_status_t)SL_STATUS_FAIL;
  }

  //Just a confirmation
  if (psa_is_key_present_in_storage(binding_key_id) == 1) {
    return (sl_status_t)SL_STATUS_FAIL;
  }

