espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_security.c
  is_bound = false;
  return (sl_status_t)SL_STATUS_OK;
}

/***************************************************************************//**
 * Initialize security session
 ******************************************************************************/
sl_status_t initialize_session(uint8_t *random1, uint8_t *random2)
{
  psa_status_t psa_status;
  const size_t half_random_len = SLI_SECURITY_SESSION_INIT_RANDOM_LENGTH_BYTES / 2;
  uint8_t random3[SLI_SECURITY_SESSION_INIT_RANDOM_LENGTH_BYTES];
  uint8_t sha256_random3[SLI_SECURITY_SHA256_LENGTH_BYTES];
  uint8_t random4[SLI_SECURITY_SESSION_INIT_RANDOM_LENGTH_BYTES + SLI_SECURITY_BINDING_KEY_LENGTH_BYTES];
  uint8_t tmp_session_key[SLI_SECURITY_SESSION_KEY_LENGTH_BYTES] = { 0 };

  // Generate Session ID and Session Key
  {
    // Both devices will construct a string of bits:  Rand-3 = Rand-1[0:255] || Rand-2[0:255]
    {
      // random1 is generated by the primary and supplied to us
      memcpy(&random3[0],
             random1,
             half_random_len);

#if (defined(SLI_CPC_DEVICE_UNDER_TEST))
      // When testing, we need a known random number to assert on the testint side
      size_t i;
      for (i = 0; i != SLI_SECURITY_SESSION_INIT_RANDOM_LENGTH_BYTES; i++) {
        random2[i] = i;
      }
#else
      // random2 is generated by the secondary
      psa_status = psa_generate_random(random2,
                                       SLI_SECURITY_SESSION_INIT_RANDOM_LENGTH_BYTES);
      if (psa_status != PSA_SUCCESS) {
        return SL_STATUS_FAIL;
      }
#endif

      memcpy(&random3[half_random_len],
             random2,
             half_random_len);
    }

    // Both devices will perform SHA256 on Rand-3
    {
      size_t hash_length;

      psa_status = psa_hash_compute(PSA_ALG_SHA_256,
                                    random3,
                                    sizeof(random3),
                                    sha256_random3,
                                    sizeof(sha256_random3),
                                    &hash_length);

      EFM_ASSERT(hash_length == sizeof(sha256_random3));

      if (psa_status != PSA_SUCCESS) {
        return SL_STATUS_FAIL;
      }
    }

    // The resulting 32-byte number will be split into two 8-byte values as follows: Result = Session-ID-Host || Session-ID-NCP || Discarded data
    {
      memcpy(nonce_primary.session_id,
             &sha256_random3[0],
             SLI_SECURITY_SESSION_ID_LENGTH_BYTES);

      memcpy(nonce_secondary.session_id,
             &sha256_random3[SLI_SECURITY_SESSION_ID_LENGTH_BYTES + 1],
             SLI_SECURITY_SESSION_ID_LENGTH_BYTES);
    }

    // To generate the session key a second string of bits is constructed:
    // Rand-4 = Rand-1[256:511] || Rand-2[256:511] || Binding Key[0:128]
    {
      size_t key_length;

      //Rand-4 = Rand-1[256:511]
      memcpy(&random4[0],
             &random1[half_random_len],
             half_random_len);

      //Rand-4 = || Rand-2[256:511]
      memcpy(&random4[half_random_len],
             &random2[half_random_len],
             half_random_len);

      //Rand-4 = || Binding Key[0:128]
      psa_status = psa_export_key(binding_key_id,
                                  &random4[2 * half_random_len], //
                                  SLI_SECURITY_BINDING_KEY_LENGTH_BYTES,
                                  &key_length);

      // Something terribly wrong if the retrived binding key length is not the
      // same as the one when it was stored
      EFM_ASSERT(key_length == SLI_SECURITY_BINDING_KEY_LENGTH_BYTES);

      if (psa_status != PSA_SUCCESS) {
        // If for whatever reason the export failed, squash random4 anyway
        mbedtls_platform_zeroize(random4, sizeof(random4));
        return SL_STATUS_FAIL;
      }
    }

    // Both devices perform SHA256 on RAND-4
    {
      size_t hash_length;

      psa_status = psa_hash_compute(PSA_ALG_SHA_256,
                                    random4,
                                    sizeof(random4),
                                    tmp_session_key,
                                    sizeof(tmp_session_key),
                                    &hash_length);

      // Squash the random4 containing the binding key in plain text now that its
      // hash has been computed
      mbedtls_platform_zeroize(random4, sizeof(random4));

      // Something is terribly wrong if sha256 doesn't give a 256 length (session key length)
      EFM_ASSERT(hash_length == SLI_SECURITY_SESSION_KEY_LENGTH_BYTES);

      if (psa_status != PSA_SUCCESS) {
        // If for whatever reason the hash failed, squash tmp_session_key anyway
        mbedtls_platform_zeroize(tmp_session_key, sizeof(tmp_session_key));
        return SL_STATUS_FAIL;
      }
    }

    // Destroy previous key if security session is being reset
    if (sl_cpc_security_get_state() == SL_CPC_SECURITY_STATE_RESETTING) {
      psa_destroy_key(session_key_id);
    }

    // The resulting 256 bit number is then used as the session key
    {
      // Set key attributes
      psa_key_attributes_t attr = psa_key_attributes_init();
      psa_set_key_algorithm(&attr, get_algorithm());
      psa_set_key_usage_flags(&attr, PSA_KEY_USAGE_ENCRYPT | PSA_KEY_USAGE_DECRYPT);
      psa_set_key_type(&attr, PSA_KEY_TYPE_AES);
      psa_set_key_bits(&attr, PSA_BYTES_TO_BITS(sizeof(tmp_session_key)));
      // psa_set_key_id() is not used because it is a volatile key, and using it
      // would implicitly mark it as persistent. psa_import_key will assign us
      // a key_id
      psa_set_key_lifetime(&attr, PSA_KEY_LIFETIME_VOLATILE);

      // Create the key and retrieve its key_id in session_key_id
      psa_status_t status = psa_import_key(&attr,
                                           tmp_session_key,
                                           sizeof(tmp_session_key),
                                           &session_key_id);

      // Squash the session_key temp buffer now that it is managed by psa_crypto
      mbedtls_platform_zeroize(tmp_session_key, sizeof(tmp_session_key));

      if (status != PSA_SUCCESS) {
        return SL_STATUS_FAIL;
      }
    }
  }

  // Initialize the nonce
  {
    security_nonce_init(&nonce_primary);
    security_nonce_init(&nonce_secondary);
  }

  set_state(SL_CPC_SECURITY_STATE_WAITING_ON_TX_COMPLETE);

