espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_security.c
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Status conversion
 ******************************************************************************/
static sl_status_t psa_status_to_sl_status(psa_status_t status)
{
  switch (status) {
    case PSA_SUCCESS:
      return SL_STATUS_OK;
      break;
    case PSA_ERROR_GENERIC_ERROR:
      return SL_STATUS_FAIL;
      break;
    case PSA_ERROR_NOT_SUPPORTED:
      return SL_STATUS_NOT_SUPPORTED;
      break;
    case PSA_ERROR_NOT_PERMITTED:
      return SL_STATUS_PERMISSION;
      break;
    case PSA_ERROR_BUFFER_TOO_SMALL:
      return SL_STATUS_WOULD_OVERFLOW;
      break;
    case PSA_ERROR_ALREADY_EXISTS:
      return SL_STATUS_ALREADY_EXISTS;
      break;
    case PSA_ERROR_DOES_NOT_EXIST:
      return SL_STATUS_NOT_FOUND;
      break;
    case PSA_ERROR_BAD_STATE:
      return SL_STATUS_INVALID_MODE;
      break;
    case PSA_ERROR_INVALID_ARGUMENT:
      return SL_STATUS_INVALID_PARAMETER;
      break;
    case PSA_ERROR_INSUFFICIENT_MEMORY:
      return SL_STATUS_NO_MORE_RESOURCE;
      break;
    case PSA_ERROR_COMMUNICATION_FAILURE:
      return SL_STATUS_IO;
      break;
    case PSA_ERROR_INVALID_SIGNATURE:
      return SL_STATUS_INVALID_SIGNATURE;
      break;
    case PSA_ERROR_INVALID_HANDLE:
      return SL_STATUS_INVALID_HANDLE;
      break;
    // no specific sl_status_t error code for those
    case PSA_ERROR_INSUFFICIENT_STORAGE:
    case PSA_ERROR_STORAGE_FAILURE:
    case PSA_ERROR_DATA_CORRUPT:
    case PSA_ERROR_DATA_INVALID:
    case PSA_ERROR_HARDWARE_FAILURE:
    case PSA_ERROR_CORRUPTION_DETECTED:
    case PSA_ERROR_INSUFFICIENT_ENTROPY:
    case PSA_ERROR_INVALID_PADDING:
    case PSA_ERROR_INSUFFICIENT_DATA:
    default:
      return SL_STATUS_FAIL;
      break;
  }
}

/***************************************************************************//**
 * Get encryption algorithm
 ******************************************************************************/
static psa_algorithm_t get_algorithm(void)
{
  return PSA_ALG_AEAD_WITH_SHORTENED_TAG(
    PSA_ALG_GCM,
    SLI_SECURITY_TAG_LENGTH_BYTES);
}

/***************************************************************************//**
 * Increment nonce's internal frame counter. Triggers a reset of the security
 * session if the frame counter reaches its maximum allowed value.
 ******************************************************************************/
static void security_nonce_increment(sli_cpc_security_nonce_t *nonce)
{
  nonce->frame_counter++;

  if (nonce->frame_counter == SLI_SECURITY_NONCE_FRAME_COUNTER_MAX_VALUE) {
    if (sl_cpc_security_get_state() == SL_CPC_SECURITY_STATE_INITIALIZED) {
      set_state(SL_CPC_SECURITY_STATE_RESETTING);
    }
  }
}

/***************************************************************************//**
 * Get security flag
 ******************************************************************************/
static size_t __sli_cpc_security_get_tag_length(void)
{
  psa_key_attributes_t attributes = PSA_KEY_ATTRIBUTES_INIT;
  psa_status_t ret;

  ret = psa_get_key_attributes(session_key_id, &attributes);
  EFM_ASSERT(ret == PSA_SUCCESS);

  return PSA_AEAD_TAG_LENGTH(
    psa_get_key_type(&attributes),
    psa_get_key_bits(&attributes),
    get_algorithm());
}

/***************************************************************************//**
 * Encrypt data
 ******************************************************************************/
static psa_status_t encrypt(const uint8_t *header,
                            const size_t header_len,
                            uint8_t *payload,
                            const size_t payload_len,
                            uint8_t *tag,
                            const size_t tag_len)
{
  psa_aead_operation_t op = PSA_AEAD_OPERATION_INIT;
  psa_status_t ret;
  size_t out_cypher_len;
  size_t out_tag_len;
  size_t out_len;

  ret = psa_aead_encrypt_setup(&op, session_key_id, get_algorithm());
  if (ret != PSA_SUCCESS) {
    return ret;
  }

  ret = psa_aead_set_lengths(&op, header_len, payload_len);
  if (ret != PSA_SUCCESS) {
    psa_aead_abort(&op);
    return ret;
  }

  ret = psa_aead_set_nonce(&op, (uint8_t*)&nonce_secondary, sizeof(nonce_secondary));
  if (ret != PSA_SUCCESS) {
    psa_aead_abort(&op);
    return ret;
  }

  ret = psa_aead_update_ad(&op, header, header_len);
  if (ret != PSA_SUCCESS) {
    psa_aead_abort(&op);
    return ret;
  }

  ret = psa_aead_update(&op,
                        payload, payload_len,
                        payload, payload_len,
                        &out_len);
  if (ret != PSA_SUCCESS) {
    psa_aead_abort(&op);
    return ret;
  }

  ret = psa_aead_finish(&op,
                        &(payload[out_len]),
                        payload_len - out_len,
                        &out_cypher_len,
                        tag,
                        tag_len,
                        &out_tag_len);
  if (ret != PSA_SUCCESS) {
    psa_aead_abort(&op);
    return ret;
  }

  // We expect the encrypted text to be the same length as the input buffer
  EFM_ASSERT(out_len + out_cypher_len == payload_len);
  EFM_ASSERT(out_tag_len == __sli_cpc_security_get_tag_length());

  return ret;
}

/***************************************************************************//**
 * Decrypt data
 ******************************************************************************/
static psa_status_t decrypt(const uint8_t *header,
                            const size_t header_len,
                            uint8_t *payload,
                            const size_t buffer_size,
                            const size_t payload_len,
                            size_t *output_len)
{
  psa_status_t ret;

  nonce_primary.endpoint_id = sli_cpc_hdlc_get_address(header);

  ret = psa_aead_decrypt(session_key_id,
                         get_algorithm(),
                         (uint8_t*)&nonce_primary,
                         sizeof(nonce_primary),
                         header, header_len,
                         payload, buffer_size,
                         payload, payload_len,
                         output_len);

  if (ret == PSA_SUCCESS) {
    EFM_ASSERT(*output_len + __sli_cpc_security_get_tag_length() == payload_len);
  }

  return ret;
}

#if (defined(SLI_CPC_DEVICE_UNDER_TEST))
/***************************************************************************//**
 * Test session initialization
 ******************************************************************************/
sl_status_t sli_cpc_security_initialize_session(uint8_t *random1, uint8_t *random2)
{
  return initialize_session(random1, random2);
}

/***************************************************************************//**
 * Test store binding key
 ******************************************************************************/
sl_status_t sli_cpc_security_store_binding_key(uint8_t * key, uint16_t key_size)
{
  return store_binding_key(key, key_size);
}

/***************************************************************************//**
 * Test erase binding key
 ******************************************************************************/
sl_status_t sli_cpc_security_erase_binding_key(void)
{
  return erase_binding_key();
}
#endif

#endif // SL_CPC_ENDPOINT_SECURITY_ENABLED

/***************************************************************************//**
 * Set Security State
 ******************************************************************************/
static void set_state(sl_cpc_security_state_t new_value)
{
  sl_atomic_store(security_state, new_value);
}
